Cassandra/WS-User/service/target/classes/User.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="User"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:di="http://www.unicam.it/cassandra/example/sso/schema/User"
	xmlns:tns="http://www.unicam.it/cassandra/example/sso/contract/User"
	targetNamespace="http://www.unicam.it/cassandra/example/sso/contract/User">
	<wsdl:types>
		<xsd:schema targetNamespace="http://www.unicam.it/cassandra/example/sso/contract/User">
			<xsd:element name="startRequestResource">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="resourceId" type="xsd:int"
							minOccurs="1" maxOccurs="1" />
						<xsd:element name="serviceProviderServer" type="xsd:string"
							minOccurs="1" maxOccurs="1"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="startRequestResourceResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="resourceAvailable" type="xsd:string" />
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="releaseResource">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="link" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="releaseResourceResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="out" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="authReq">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="key" type="xsd:string" minOccurs="1"
							maxOccurs="1"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="authReqResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="out" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="identityPrincipal">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="token" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="identityPrincipalResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="out" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="response">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="in" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="responseResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="out" type="xsd:string"></xsd:element>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="startRequestResourceRequest">
		<wsdl:part element="tns:startRequestResource" name="parameters" />
	</wsdl:message>
	<wsdl:message name="startRequestResourceResponse">
		<wsdl:part element="tns:startRequestResourceResponse" name="parameters" />
	</wsdl:message>
	<wsdl:message name="authReqRequest">
		<wsdl:part name="parameters" element="tns:authReq"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="authReqResponse">
		<wsdl:part name="parameters" element="tns:authReqResponse"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="identityPrincipalRequest">
		<wsdl:part name="parameters" element="tns:identityPrincipal"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="identityPrincipalResponse">
		<wsdl:part name="parameters" element="tns:identityPrincipalResponse"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="responseRequest">
		<wsdl:part name="parameters" element="tns:response"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="responseResponse">
		<wsdl:part name="parameters" element="tns:responseResponse"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="releaseResourceRequest">
		<wsdl:part name="parameters" element="tns:releaseResource"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="releaseResourceResponse">
		<wsdl:part name="parameters" element="tns:releaseResourceResponse"></wsdl:part>
	</wsdl:message>

	<wsdl:portType name="UserPortType">
		<wsdl:operation name="startRequestResource">
			<wsdl:input message="tns:startRequestResourceRequest" />
			<wsdl:output message="tns:startRequestResourceResponse" />
		</wsdl:operation>
		<wsdl:operation name="authReq">
			<wsdl:input message="tns:authReqRequest"></wsdl:input>
			<wsdl:output message="tns:authReqResponse"></wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="releaseResource">
			<wsdl:input message="tns:releaseResourceRequest"></wsdl:input>
			<wsdl:output message="tns:releaseResourceResponse"></wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="response">
			<wsdl:input message="tns:responseRequest"></wsdl:input>
			<wsdl:output message="tns:responseResponse"></wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="identityPrincipal">
			<wsdl:input message="tns:identityPrincipalRequest"></wsdl:input>
			<wsdl:output message="tns:identityPrincipalResponse"></wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="UserBinding" type="tns:UserPortType">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="startRequestResource">
			<soap:operation
				soapAction="http://www.unicam.it/cassandra/example/sso/contract/User/startRequestResource" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="authReq">
			<soap:operation
				soapAction="http://www.unicam.it/cassandra/example/sso/contract/User/authReq" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="releaseResource">
			<soap:operation
				soapAction="http://www.unicam.it/cassandra/example/sso/contract/User/releaseResource" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="response">
			<soap:operation
				soapAction="http://www.unicam.it/cassandra/example/sso/contract/User/response" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="identityPrincipal">
			<soap:operation
				soapAction="http://www.unicam.it/cassandra/example/sso/contract/User/identityPrincipal" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="UserService">
		<wsdl:port name="UserPort" binding="tns:UserBinding">
			<!-- Default address for Tomcat deployment (CXF/Metro) -->
			<soap:address location="http://localhost:8080/user/services/user" />
			<!-- Default address for Karaf deployment (CXF only) -->
			<!--soap:address location="http://localhost:8181/cxf/user"/ -->
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions> 

